homework/my_app/app/controllers/categories_controller.rb

SELECT * FROM "categories"
---
  def index
    @categories = Category.all

INSERT INTO "categories" ("name", "updated_at", "description", "created_at") VALUES('Misc.', '2010-06-15 01:45:03', 'whatever!', '2010-06-15 01:45:03')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save