homework/my_app/app/controllers/notes_controller.rb

SELECT * FROM "notes"
---
  def index
    @notes = Note.all

SELECT * FROM "categories" WHERE ("categories"."name" = 'JBS-homework') LIMIT 1
---
  def category
    #Find the category object from its name
	@category = Category.find_by_name(params[:id])

SELECT * FROM "notes" WHERE ("notes"."id" = 1)
---
  def show
    @note = Note.find(params[:id])

SELECT * FROM "notes" WHERE ("notes"."id" = 1)
---
  def edit
    @note = Note.find(params[:id])

INSERT INTO "notes" ("updated_at", "title", "description", "category_id", "created_at") VALUES('2010-06-15 02:14:19', 'Scrum', 'Read ch 1, 2 of agile with scrum ', 2, '2010-06-15 02:14:19')
---
  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save

SELECT * FROM "notes" WHERE ("notes"."id" = 2)
---
  def update
    @note = Note.find(params[:id])

SELECT * FROM "notes" WHERE ("notes"."id" = 1)
DELETE FROM "notes" WHERE "id" = 1
---
  def destroy
    @note = Note.find(params[:id])
    @note.destroy