homework/my_app/app/controllers/users_controller.rb

  def create
	@user = User.new(params[:user])
	if @user.save
---
INSERT INTO "users" ("updated_at", "crypted_password", "username", "password_salt", "persistence_token", "email", "created_at") VALUES('2010-06-28 00:45:03', 'b4238cf4d2ae17db0c22976e3b912b6df04e5896928518badaac80dd5970038841736336060cc3761efdf63f0efe19329f1324a150c0fd547668bb9c6189f3c7', 'charu', 'FeF9BVAlwxxqddUi8Qzy', '2e77c9596a2b9014cb579fd013b5a4ae34549996ea4222b95293ed44bf8dfa732cf867df2c386e40362700f2da44d46058cebcab4512c05e2f739213420f4a83', 'cjain@brandeis.edu', '2010-06-28 00:45:03')