homework/hw04/my_app/app/controllers/friends_controller.rb

SELECT * FROM "friends"
---
  def index
    @friends = Friend.all

SELECT * FROM "friends" WHERE ("friends"."id" = 1)
---
  def show
    @friend = Friend.find(params[:id])

SELECT * FROM "friends" WHERE ("friends"."id" = 2)
---
  def edit
    @friend = Friend.find(params[:id])

INSERT INTO "friends" ("name", "updated_at", "since", "comment", "group", "created_at") VALUES('Deepali', '2010-06-08 11:25:37', '15 yrs', 'childhood friend', 'First School', '2010-06-08 11:25:37')
---
  def create
    @friend = Friend.new(params[:friend])

    respond_to do |format|
      if @friend.save

SELECT * FROM "friends" WHERE ("friends"."id" = 2)
UPDATE "friends" SET "comment" = 'same interests', "updated_at" = '2010-06-08 13:50:22' WHERE "id" = 2
---
  def update
    @friend = Friend.find(params[:id])

    respond_to do |format|
      if @friend.update_attributes(params[:friend])